server-test-evidence/20260824T005513Z/ab-https-static-c1000-n10000.log
This is ApacheBench, Version 2.3 <$Revision: 1934973 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8443
SSL/TLS Protocol:       TLSv1.3,TLS_AES_128_GCM_SHA256,2048,128
Server Temp Key:        X25519 253 bits

Document Path:          /
Document Length:        397 bytes

Concurrency Level:      1000
Time taken for tests:   1.734 seconds
Complete requests:      10000
Failed requests:        0
Keep-Alive requests:    10000
Total transferred:      6060000 bytes
HTML transferred:       3970000 bytes
Requests per second:    5766.02 [#/sec] (mean)
Time per request:       173.430 [ms] (mean)
Time per request:       0.173 [ms] (mean, across all concurrent requests)
Transfer rate:          3412.31 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   67 209.4      0    1177
Processing:     0   94 112.7     67    1057
Waiting:        0   94 112.7     67    1057
Total:          0  161 273.7     70    1298

Percentage of the requests served within a certain time (ms)
  50%     70
  66%     88
  75%    102
  80%    117
  90%    561
  95%   1027
  98%   1126
  99%   1146
 100%   1298 (longest request)